import { Box, Typography } from '@mui/material'

export default function Home() {
  return (
    <>
      <Box>
        <Typography variant={'h1'}>ネコ</Typography>
        <Typography variant={'body1'}>
          ネコ（猫）は、狭義には食肉目ネコ科ネコ属に分類されるリビアヤマネコ（ヨーロッパヤマネコ）が家畜化されたイエネコ（家猫、Felis
          silvestris
          catus）に対する通称である。イヌ（犬）と並ぶ代表的なペットとして、世界中で飼われている。広義的には、ヤマネコやネコ科動物全般を指すこともある（後述）。
          猫は鋭い視覚、敏感な聴覚、優れた嗅覚を持ち、体が非常に柔軟であるため狭い場所や高い場所にも容易に登ることができる。独立心が強く、縄張り意識が高いのも特徴で、狩猟本能が強いため、しばしば遊びながらその本能を発揮する。自分の領域を守るためのマーキング行動や、鳴き声、体の動きを使ったコミュニケーションも行う。肉食である猫は、栄養バランスの取れた食事を必要とし、人間による世話にも一定の注意を要する。定期的な健康診断、ワクチン接種、そして適切なグルーミングが飼育には必要であり、トイレトレーニングは比較的容易だが、猫は他の訓練に関しては独立した性格のため、しつけが難しいことが多い。
        </Typography>

        <Typography variant={'h1'}>定義</Typography>
        <Typography variant={'body1'}>
          イエネコの起源は、ネズミを捕獲させる目的で飼われ始めたリビアヤマネコの家畜化である[1][2]。リビアヤマネコは独立種
          Felis lybica Forster, 1780とされるが、ヨーロッパヤマネコの亜種 Felis
          silvestris lybica Forster,
          1780ともされる[3]。その場合イエネコを含むヨーロッパヤマネコの学名は、記載が古いFelis
          catus Linnaeus,
          1758となるのが命名法上の原則である。しかしこれを原則通りに運用すると様々な支障が出ることから、2003年にICZNの強権によりFelis
          silvestris Schreber,
          1777をイエネコを含むヨーロッパヤマネコの学名として使用できることが認められた（Opinion
          2027）[4]。つまりヨーロッパヤマネコの亜種としてのイエネコの学名は、Felis
          silvestris catus Linnaeus,
          1758とすることができる。なおイエネコをヨーロッパヤマネコと別種として扱う場合には、イエネコの学名はFelis
          catusが正しい。
          一方、広義の「ネコ」は、ネコ類（ネコ科動物）の一部、あるいはその全ての包括的分類を指し、家畜種のイエネコに加えて広義のヤマネコ類を含む。特に学術用語としては、英語の「cat」と同様、トラやライオンなどといった大型種を含む全てのネコ科動物を指すことがある。
          以下、本項では特記なき限りネコ=イエネコとして解説する。
        </Typography>
      </Box>
    </>
  )
}
